import Head from "next/head";
import { NextPage } from "next";

const MigawariPrivacyPolicyJaPage: NextPage = () => {
  return (
    <>
      <Head>
        <title>Migawari ~しつこいセールスや勧誘を男の声で撃退~</title>
        <meta
          name="description"
          content="Migawariはしつこい訪問販売や勧誘に困っている一人暮らしの方向けに男性のボイスを提供するアプリです。"
        />
      </Head>
      <section className="container">
        <div className="section">
          <strong>プライバシーポリシー</strong>
          <p>
            YuheiNakasakaは、Migawariiアプリを広告サポートのアプリとして開発しました。この
            サービスはYuheiNakasakaが無償で提供し、そのまま利用することを意図しています。
          </p>
          <p>
            このページは、私のサービスを利用することを選んだ方々に、個人情報の収集、使用、開示に関する私の方針について知らせるためのものです。
          </p>
          <p>
            私のサービスを利用することを選択した場合、あなたはこのポリシーに関連する情報の収集と利用に同意したことになります。私が収集する個人情報は、サービスの提供と改善に使用されます。私は、このプライバシーポリシーに記述された場合を除き、あなたの情報を他の誰とも共有または使用しません。
          </p>
          <p>
            このプライバシーポリシーで使用される用語は、私たちの利用規約と同じ意味を持ちます。これはMigawariiでアクセス可能で、このプライバシーポリシーで他に定義されていない限りです。
          </p>
        </div>
        <div className="section">
          <p>
            <strong>情報の収集と使用</strong>
          </p>
          <p>
            より良い体験を提供するため、私たちのサービスを使用する際に、特定の個人を識別できる情報を提供することを求めることがあります。私が要求する情報は、あなたのデバイスに保存され、私が何らかの方法で収集することはありません。
          </p>
          <div>
            <p>
              アプリは、あなたを識別するための情報を収集する可能性のある第三者のサービスを使用しています。
            </p>
            <p>
              アプリが使用している第三者サービスプロバイダーのプライバシーポリシーへのリンク
            </p>
            <ul>
              <li>
                <a
                  href="https://support.google.com/admob/answer/6128543?hl=ja"
                  target="_blank"
                  rel="noopener noreferrer"
                >
                  AdMob
                </a>
              </li>
              <li>
                <a
                  href="https://firebase.google.com/policies/analytics"
                  target="_blank"
                  rel="noopener noreferrer"
                >
                  Google Analytics for Firebase
                </a>
              </li>
            </ul>
          </div>
        </div>
        <div className="section">
          <p>
            <strong>ログデータ</strong>
          </p>
          <p>
            アプリでエラーが発生した場合など、私のサービスを使用する際には、私はあなたの携帯電話上のデータと情報（第三者の製品を通じて）を収集します。これはログデータと呼ばれます。このログデータには、あなたのデバイスのインターネットプロトコル（“IP”）アドレス、デバイス名、オペレーティングシステムのバージョン、私のサービスを利用する際のアプリの設定、サービスの使用の時間と日付、および他の統計情報などが含まれる場合があります。
          </p>
        </div>
        <div className="section">
          <p>
            <strong>クッキー</strong>
          </p>
          <p>
            クッキーは、一般的に匿名のユニークな識別子として使用される少量のデータを含むファイルです。これらは、訪れたウェブサイトからあなたのブラウザに送信され、あなたのデバイスの内部メモリに保存されます。
          </p>
          <p>
            このサービスは明示的にこれらの“クッキー”を使用していません。しかし、アプリは情報を収集し、そのサービスを改善するために“クッキー”を使用する第三者のコードやライブラリを使用することがあります。あなたはこれらのクッキーを受け入れるか拒否する選択肢を持ち、クッキーがあなたのデバイスに送信されるときにそれを知ることができます。私たちのクッキーを拒否することを選択した場合、このサービスの一部を使用することができない可能性があります。
          </p>
        </div>
        <div className="section">
          <p>
            <strong>サービス提供者</strong>
          </p>
          <p>私は以下の理由から、第三者の企業や個人を雇うことがあります：</p>
          <ul>
            <li>私たちのサービスを促進するため;</li>
            <li>私たちの代わりにサービスを提供するため;</li>
            <li>サービス関連のサービスを提供するため; または</li>
            <li>
              私たちのサービスがどのように使用されているかを分析するのを助けるため。
            </li>
          </ul>
          <p>
            このサービスのユーザーに通知したいのは、これらの第三者があなたの個人情報にアクセスすることができるということです。理由は、私たちの代わりに割り当てられたタスクを実行するためです。ただし、他の目的で情報を開示したり使用したりすることは義務付けられていません。
          </p>
        </div>
        <div className="section">
          <p>
            <strong>セキュリティ</strong>
          </p>
          <p>
            私たちは、あなたの個人情報を提供していただいた信頼を大切にし、それを保護するために商業的に受け入れられる手段を使用する努力をしています。しかし、インターネット上の伝送、または電子的なストレージ方法は100%安全で信頼性がありませんので、その絶対的な安全性を保証することはできません。
          </p>
        </div>
        <div className="section">
          <p>
            <strong>他のサイトへのリンク</strong>
          </p>
          <p>
            このサービスは他のサイトへのリンクを含むことがあります。第三者のリンクをクリックすると、そのサイトに移動します。これらの外部サイトは私が運営しているわけではないので、これらのウェブサイトのプライバシーポリシーを確認することを強くお勧めします。私は、第三者のサイトやサービスのコンテンツ、プライバシーポリシー、または慣行について一切の管理権を持っていないこと、また、それらに対する一切の責任を負いません。
          </p>
        </div>
        <div className="section">
          <p>
            <strong>子供のプライバシー</strong>
          </p>
          <p>
            これらのサービスは13歳未満の方を対象としていません。私は、13歳未満の子供から故意に個人を識別できる情報を収集することはありません。13歳未満の子供が私に個人情報を提供していることを発見した場合、私は直ちに当社のサーバーからこれを削除します。あなたが親または保護者であり、あなたの子供が私たちのサービスを提供している情報を提供していることを知っている場合、私に連絡してください。そのような情報を削除するための手続きを行います。
          </p>
        </div>
        <div className="section">
          <p>
            <strong>このプライバシーポリシーの変更</strong>
          </p>
          <p>
            私たちは、必要に応じてこのプライバシーポリシーを定期的に更新します。したがって、新しいプライバシーポリシーが投稿されたときに、このページを定期的に確認することをお勧めします。新しいプライバシーポリシーが投稿されたら、このページで通知します。
          </p>
        </div>
        <div className="section">
          <p>
            <strong>私たちに連絡してください</strong>
          </p>
          <p>
            このプライバシーポリシーに関して質問や提案がある場合は、
            <a href="mailto:mochiogaile@gmail.com">mochiogaile@gmail.com</a>
            までお気軽にご連絡ください。
          </p>
        </div>
      </section>

      <style global jsx>{`
        .container {
          min-height: 100vh;
          padding: 0 30px 30px 30px;
        }
        .section {
          margin: 0 0 30px 0;
        }
        a {
          color: #3182ce;
        }
      `}</style>
    </>
  );
};

export default MigawariPrivacyPolicyJaPage;
